Revit 2027 API
TextNote.AddLeader Method
 Adds a leader to the text note.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Leader AddLeader(
	TextNoteLeaderTypes leaderType
)
Public Function AddLeader (
	leaderType As TextNoteLeaderTypes
) As Leader
public:
Leader^ AddLeader(
	TextNoteLeaderTypes leaderType
)
member AddLeader :
        leaderType : TextNoteLeaderTypes -> Leader
Parameters
leaderType TextNoteLeaderTypes
 Type of the leader being added.
Return Value
Leader
 The newly added leader.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 If the geometric type of the new leader (line vs arc.) differs from the type of existing leaders, then the type of the existing leaders will be changed to match the type of the newly created leader.
See Also
Reference
TextNote Class
Autodesk.Revit.DB Namespace